In [1]:
import pymysql
pymysql.install_as_MySQLdb()
import pandas as pd
from sqlalchemy import create_engine

In [2]:
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
username = "root"
password = quote_plus("Poppie@21075") # Using the quote function to make the password compatible
db_name = "Sakila"

In [3]:
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'
engine = create_engine(connection)

In [9]:
q = """SELECT * FROM customer
LIMIT 5;"""
pd.read_sql(q, engine)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-14 12:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-14 12:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-14 12:57:20
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36,2006-02-14 12:57:20
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-14 12:57:20

1. What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [14]:
q = '''SELECT c.first_name, c.last_name, c.email, a.address, a.city_id
FROM customer AS c
JOIN address AS a 
ON c.address_id = a.address_id
WHERE a.city_id = 312'''
pd.read_sql(q,engine)

,first_name,last_name,email,address,city_id
0,MATTIE,HOFFMAN,MATTIE.HOFFMAN@sakilacustomer.org,1497 Yuzhou Drive,312
1,CECIL,VINES,CECIL.VINES@sakilacustomer.org,548 Uruapan Street,312

2. What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return film title, description, release year, rating, and special features.

In [19]:
q = '''SELECT f.title, f.description, f.release_year, f.rating, f.special_features, c.name
FROM film AS f
JOIN
category AS c
ON f.film_id = c.category_id
WHERE c.name = 'comedy';'''
pd.read_sql(q,engine)

,title,description,release_year,rating,special_features,name
0,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,G,Deleted Scenes,Comedy

3. What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

In [20]:
q = '''SELECT a.last_name, f.title, f.release_year
FROM actor AS a 
JOIN film AS f
ON film_id = actor_id
WHERE a.last_name = 'Lollobrigida';'''
pd.read_sql(q,engine)

      last_name        title  release_year
0  LOLLOBRIGIDA  AFRICAN EGG          2006

4. What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

In [21]:
q = '''SELECT a.first_name, a.last_name, f.title
FROM actor a 
JOIN film f 
ON a.actor_id = f.film_id
WHERE f.title ="Bingo Talented";'''
pd.read_sql(q,engine)

  first_name last_name           title
0       GARY      PENN  BINGO TALENTED

5. What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

In [58]:
q = '''SELECT customer_id, amount 
FROM payment 
WHERE amount > 2 *
	(SELECT AVG(amount)
    FROM payment);
'''
pd.read_sql(q,engine)

     customer_id  amount
0              1    9.99
1              2   10.99
2              3    8.99
3              3   10.99
4              3    8.99
..           ...     ...
852          595    9.99
853          595   10.99
854          597    8.99
855          599    9.99
856          599    8.99

[857 rows x 2 columns]

6. What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

In [50]:
q = '''SELECT c.first_name, c.last_name,
	(SELECT COUNT(*)
	FROM payment AS p
	WHERE c.customer_id = p.customer_id) AS num_payments 
FROM customer AS c 
ORDER BY num_payments DESC
LIMIT 5'''
pd.read_sql(q,engine)

  first_name last_name  num_payments
0    ELEANOR      HUNT            46
1       KARL      SEAL            45
2     MARCIA      DEAN            42
3      CLARA      SHAW            42
4      TAMMY   SANDERS            41